let seasons = {
    
    data(){
        return{
            all_season:[
                {
                    name : '第一赛季',
                    open : false,
                    card_bags:[
                        {
                            name : '开局名将',
                            post:require('../../assets/season/mmexport1654956673165.png'),
                            pool:[
                                {
                                    id:600,
                                },
                                {
                                    id:800,
                                },
                                {
                                    id:900,
                                },
                                {
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    id:3400,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },
                                {
                                    id:10400,
                                },
                            ]
                        },
                        {
                            name : '黄天当立',
                            post:require('../../assets/season/mmexport1654956720815.png'),
                            pool:[
                                {
                                    //张宝
                                    id:1700,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    //张角
                                    id:8500,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },

                            ]
                        },
                        {
                            name:'汉室衰微',
                            post:require('../../assets/season/mmexport1654956798120.jpg'),
                            pool:[
                                {
                                    //大小乔
                                    id : 1200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    //袁绍
                                    id : 7800,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                            ]
                        },
                        {
                            name:'天下大乱',
                            post:require('../../assets/season/mmexport1655019336604.png'),
                            pool:[
                                {
                                    id : 500,
                                },
                                {
                                    id : 800,
                                },
                                {
                                    id : 1300,
                                },
                                {
                                    id : 1400,
                                },
                                {
                                    id : 1900,
                                },
                                {
                                    id : 3900,
                                },
                                {
                                    id : 10400,
                                },
                                {
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name:'厉兵秣马',
                            post:require('../../assets/season/mmexport60e71252fda2f1e678816724ac5f9ee6_16550194.png'),
                            pool:[
                                {
                                    id : 3200,
                                },
                                {
                                    id : 3500,
                                },
                                {
                                    id : 3700,
                                },
                                {
                                    id : 4100,
                                },
                                {
                                    id : 7100,
                                },
                                {
                                    id : 9000,
                                },
                                {
                                    id : 9600,
                                },
                                {
                                    id : 10000,
                                },
                            ]
                        },
                        {
                            name:'群雄割据',
                            post:require('../../assets/season/Screenshot_20220514_122748_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 1100,
                                },
                                {
                                    id : 4700,
                                },
                                {
                                    id : 5300,
                                },
                                {
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id : 9900,
                                },
                                
                            ]
                        },
                        {
                            name:'乱世英雄',
                            post:require('../../assets/season/dawdawd22.png'),
                            pool:[
                                {
                                    id : 4600,
                                },
                                {
                                    id : 7700,
                                },
                                {
                                    id : 8300,
                                },
                                {
                                    id : 8800,
                                },
                                {
                                    id : 9400,
                                },
                                {
                                    id : 9500,
                                },
                                {
                                    id : 9700,
                                },
                                {
                                    id : 10500,
                                },
                            ]
                        },
                        {
                            name:'南蛮入侵',
                            post:require('../../assets/season/jhfgkjbie565.jpg'),
                            pool:[
                                {
                                    id : 800,
                                },
                                {
                                    id : 2100,
                                },
                                {
                                    id : 3100,
                                },
                                {
                                    id : 4100,
                                },
                                {
                                    id : 5400,
                                },
                                {
                                    id : 6100,
                                },
                                {
                                    id : 8400,
                                },
                                {
                                    id : 9300,
                                },
                            ]
                        },
                        {
                            name : '名将<--黄天当立',
                            post:require('../../assets/season/mmexport1654956673165.png'),
                            pool:[
                                {
                                    id:600,
                                },
                                {
                                    id:800,
                                },
                                {
                                    id:900,
                                },
                                {
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    id:10400,
                                },
                            ]
                        },
                        {
                            name : '名将<--汉室衰微',
                            post:require('../../assets/season/mmexport1654956673165.png'),
                            pool:[
                                {
                                    id:600,
                                },
                                {
                                    id:800,
                                },
                                {
                                    id:900,
                                },
                                {
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },
                            ]
                        },
                        {
                            name : '名将<--天下大乱',
                            post:require('../../assets/season/mmexport1654956673165.png'),
                            pool:[
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name : '名将<--厉兵秣马',
                            post:require('../../assets/season/mmexport1654956673165.png'),
                            pool:[
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3500,
                                },{
                                    id : 3700,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },{
                                    id : 4100,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },{
                                    id : 7100,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },{
                                    id : 10000,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name : '名将<--群雄割据',
                            post:require('../../assets/season/mmexport1654956673165.png'),
                            pool:[
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3500,
                                },{
                                    id : 3700,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },{
                                    id : 4100,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },{
                                    id : 4700,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },{
                                    id : 5300,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },{
                                    id : 7100,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },{
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },{
                                    id : 9900,
                                },{
                                    id : 10000,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name : '名将<--乱世英雄',
                            post:require('../../assets/season/mmexport1654956673165.png'),
                            pool:[
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3500,
                                },{
                                    id : 3700,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },{
                                    id : 4100,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },{
                                    id : 4700,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },{
                                    id : 5300,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },{
                                    id : 7100,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id : 7700,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id : 8300,
                                },
                                {
                                    id:8500,
                                },{
                                    id : 8800,
                                },{
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id : 9400,
                                },
                                {
                                    id : 9500,
                                },
                                {
                                    id:9600,
                                },{
                                    id : 9700,
                                },
                                {
                                    id:9800,
                                },{
                                    id : 9900,
                                },{
                                    id : 10000,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10500,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name : '名将<--南蛮入侵',
                            post:require('../../assets/season/mmexport1654956673165.png'),
                            pool:[
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },{
                                    id : 2100,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id : 3100,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3500,
                                },{
                                    id : 3700,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },{
                                    id : 4100,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },{
                                    id : 4700,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },{
                                    id : 5300,
                                },
                                {
                                    id : 5400,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id : 6100,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },{
                                    id : 7100,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id : 7700,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id : 8300,
                                },
                                {
                                    id : 8400,
                                },
                                {
                                    id:8500,
                                },{
                                    id : 8800,
                                },{
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id : 9300,
                                },
                                {
                                    id : 9400,
                                },
                                {
                                    id : 9500,
                                },
                                {
                                    id:9600,
                                },{
                                    id : 9700,
                                },
                                {
                                    id:9800,
                                },{
                                    id : 9900,
                                },{
                                    id : 10000,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10500,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                    ]

                },
                {
                    name : '第二赛季',
                    open : false,
                    card_bags:[
                        {
                            name : '赛季名将',
                            post:require('../../assets/season/Screenshot_20220504_124144_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id:350
                                },
                                {
                                    id:1500
                                },
                                {
                                    id:3300
                                },
                                {
                                    id:4800
                                },
                                {
                                    id:4850
                                },
                                {
                                    id:5400
                                },
                                {
                                    id:5450
                                },
                                {
                                    id:6500
                                },
                                {
                                    id:7120
                                },
                                {
                                    id:7820
                                },
                            ]
                        },
                        {
                            name : '开局名将',
                            post:require('../../assets/season/Screenshot_20220514_122632_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id:600,
                                },
                                {
                                    id:800,
                                },
                                {
                                    id:900,
                                },
                                {
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    id:3400,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },
                                {
                                    id:10400,
                                },
                            ]
                        },
                        {
                            name : '黄天当立',
                            post:require('../../assets/season/mmexport1654956720815.png'),
                            pool:[
                                {
                                    //张宝
                                    id:1700,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                    index:1,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    //张角
                                    id:8500,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },

                            ]
                        },
                        {
                            name:'汉室衰微',
                            post:require('../../assets/season/Screenshot_20220413_180947_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    //大小乔
                                    id : 1200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    //袁绍
                                    id : 7800,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                            ]
                        },
                        {
                            name:'天下大乱',
                            post:require('../../assets/season/Screenshot_20220504_124148_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 500,
                                },
                                {
                                    id : 800,
                                },
                                {
                                    id : 1300,
                                },
                                {
                                    id : 1900,
                                },
                                {
                                    id : 3900,
                                },
                                {
                                    id : 7820,
                                },
                                {
                                    id : 10400,
                                },
                                {
                                    id : 10600,
                                },
                                
                            ]
                        },
                        {
                            name:'厉兵秣马',
                            post:require('../../assets/season/vbsdjdfe47357.jpg'),
                            pool:[
                                {
                                    id : 3200,
                                },
                                {
                                    id : 3500,
                                },
                                {
                                    id : 3700,
                                },
                                {
                                    id : 4100,
                                },
                                {
                                    id : 4850,
                                },
                                {
                                    id : 7100,
                                },
                                
                                {
                                    id : 9600,
                                },
                                {
                                    id : 10000,
                                },
                            ]
                        },
                        {
                            name:'群雄割据',
                            post:require('../../assets/season/Screenshot_20220504_124156_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 1100,
                                },
                                {
                                    id : 4700,
                                },
                                {
                                    id : 5300,
                                },
                                {
                                    id : 7120,
                                },
                                {
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id : 9900,
                                },
                                
                            ]
                        },
                        {
                            name:'乱世英雄',
                            post:require('../../assets/season/dawdawd22.png'),
                            pool:[
                                {
                                    id : 350,
                                },
                                {
                                    id : 7700,
                                },
                                {
                                    id : 8300,
                                },
                                {
                                    id : 9400,
                                },
                                {
                                    id : 9500,
                                },
                                {
                                    id : 9700,
                                },
                                {
                                    id : 10500,
                                },
                            ]
                        },
                        {
                            name:'南蛮入侵',
                            post:require('../../assets/season/chduedhwhdadu.jpg'),
                            pool:[
                                {
                                    id : 300,
                                },
                                {
                                    id : 700,
                                },
                                {
                                    id : 2100,
                                },
                                {
                                    id : 3100,
                                },
                                {
                                    id : 5400,
                                },
                                {
                                    id : 5450,
                                },
                                {
                                    id : 6100,
                                },
                                {
                                    id : 8400,
                                },
                                {
                                    id : 9300,
                                },
                            ]
                        },
                        {
                            name : '名将<--黄天当立',
                            post:require('../../assets/season/Screenshot_20220514_122632_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id:600,
                                },
                                {
                                    id:800,
                                },
                                {
                                    id:900,
                                },
                                {
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    id:10400,
                                },
                            ]
                        },
                        {
                            name : '名将<--汉室衰微',
                            post:require('../../assets/season/Screenshot_20220514_122632_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id:600,
                                },
                                {
                                    id:800,
                                },
                                {
                                    id:900,
                                },
                                {
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },
                            ]
                        },
                        {
                            name : '名将<--天下大乱',
                            post:require('../../assets/season/Screenshot_20220514_122632_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id:7800,
                                },{
                                    id : 7820
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name : '名将<--厉兵秣马',
                            post:require('../../assets/season/Screenshot_20220514_122632_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3500,
                                },{
                                    id : 3700,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },{
                                    id : 4100,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },
                                {
                                    id:4800,
                                },
                                {
                                    id:4850,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },{
                                    id : 7100,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id:7800,
                                },{
                                    id:7820,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },{
                                    id : 10000,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name : '名将<--群雄割据',
                            post:require('../../assets/season/Screenshot_20220514_122632_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3500,
                                },{
                                    id : 3700,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },{
                                    id : 4100,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },{
                                    id : 4700,
                                },
                                {
                                    id:4800,
                                },{
                                    id:4850,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },{
                                    id : 5300,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },{
                                    id : 7100,
                                },{
                                    id : 7120,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id:7800,
                                },{
                                    id:7820,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id:8500,
                                },{
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id:9600,
                                },
                                {
                                    id:9800,
                                },{
                                    id : 9900,
                                },{
                                    id : 10000,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name : '名将<--乱世英雄',
                            post:require('../../assets/season/Screenshot_20220514_122632_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 350,
                                },
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3500,
                                },{
                                    id : 3700,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },{
                                    id : 4100,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },{
                                    id : 4700,
                                },
                                {
                                    id:4800,
                                },{
                                    id:4850,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },{
                                    id : 5300,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },{
                                    id : 7100,
                                },{
                                    id : 7120,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id : 7700,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    id:7820,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id : 8300,
                                },
                                {
                                    id:8500,
                                },{
                                    id : 8800,
                                },{
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id : 9400,
                                },
                                {
                                    id : 9500,
                                },
                                {
                                    id:9600,
                                },{
                                    id : 9700,
                                },
                                {
                                    id:9800,
                                },{
                                    id : 9900,
                                },{
                                    id : 10000,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10500,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                        {
                            name : '名将<--南蛮入侵',
                            post:require('../../assets/season/Screenshot_20220514_122632_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 350
                                },
                                {
                                    id : 500,
                                },{
                                    id:600,
                                },{
                                    id:800,
                                },{
                                    id:900,
                                },{
                                    id:1000,
                                },
                                {
                                    id:1100,
                                },
                                {
                                    //大小乔
                                    id : 1200,
                                },{
                                    id : 1300,
                                },
                                {
                                    id:1400,
                                },
                                {
                                    id:1500,
                                },
                                {
                                    //张宝
                                    id:1700,
                                },{
                                    id : 1900,
                                },
                                {
                                    //张梁
                                    id:2000,
                                },{
                                    id : 2100,
                                },
                                {
                                    //张宁
                                    id:2200,
                                },
                                {
                                    //贾诩
                                    id : 2300,
                                },
                                {
                                    //公孙瓒
                                    id:2500,
                                },
                                {
                                    id : 3100,
                                },
                                {
                                    id:3200,
                                },
                                {
                                    //群董卓
                                    id:3300,
                                },
                                {
                                    id:3400,
                                },{
                                    id : 3500,
                                },{
                                    id : 3700,
                                },{
                                    id : 3900,
                                },
                                {
                                    //许褚
                                    id : 4000,
                                },{
                                    id : 4100,
                                },
                                {
                                    id:4100,
                                },
                                {
                                    id:4600,
                                },{
                                    id : 4700,
                                },
                                {
                                    id:4800,
                                },{
                                    id:4850,
                                },
                                {
                                    id:5100,
                                },
                                {
                                    id:5200,
                                },{
                                    id : 5300,
                                },
                                {
                                    id : 5400,
                                },
                                {
                                    id : 5450,
                                },
                                {
                                    //法正
                                    id : 5700,
                                },
                                {
                                    id : 6100,
                                },
                                {
                                    id:6500,
                                },
                                {
                                    id:6600,
                                },
                                {
                                    id:6800,
                                },{
                                    id : 7100,
                                },{
                                    id : 7120,
                                },
                                {
                                    //朱儁
                                    id : 7400,
                                },
                                {
                                    //张机
                                    id : 7500,
                                },
                                {
                                    id : 7700,
                                },
                                {
                                    id:7800,
                                },
                                {
                                    id:7820,
                                },
                                {
                                    //潘凤
                                    id:7900,
                                },
                                {
                                    id:8000,
                                },
                                {
                                    id : 8300,
                                },
                                {
                                    id : 8400,
                                },
                                {
                                    id:8500,
                                },{
                                    id : 8800,
                                },{
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id:9000,
                                },
                                {
                                    id:9200,
                                },
                                {
                                    id : 9300,
                                },
                                {
                                    id : 9400,
                                },
                                {
                                    id : 9500,
                                },
                                {
                                    id:9600,
                                },{
                                    id : 9700,
                                },
                                {
                                    id:9800,
                                },{
                                    id : 9900,
                                },{
                                    id : 10000,
                                },
                                {
                                    //何太后
                                    id:10200,
                                },
                                {
                                    //汉貂蝉
                                    id : 10300,
                                },
                                {
                                    id:10400,
                                },{
                                    id : 10500,
                                },{
                                    id : 10600,
                                },
                            ]
                        },
                    ]
                },
                {
                    name : '第三赛季',
                    open : false,
                    card_bags : [
                        {
                            name : '贤臣猛将',
                            post:require('../../assets/season/mmexport1654956777391.png'),
                            pool:[
                                {
                                    id : 60
                                },
                                {
                                    id : 2100
                                },
                                {
                                    id : 4852
                                },
                                {
                                    id : 4855
                                },
                                {
                                    id : 8900
                                },
                                {
                                    id : 9600
                                },
                                {
                                    id : 9900
                                },
                                {
                                    id : 10120
                                },
                                
                                // {
                                //     id : 100
                                // },
                            ]
                        },
                        {
                            name : '豹骑虎将',
                            post:require('../../assets/season/Screenshot_20220511_180153_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 3200
                                },
                                {
                                    id : 3500
                                },
                                {
                                    id : 3700
                                },
                                {
                                    id : 4100
                                },
                                {
                                    id : 4852
                                },
                                {
                                    id : 7100
                                },
                                {
                                    id : 9600
                                },
                                {
                                    id : 10000
                                },
                                
                                // {
                                //     id : 100
                                // },
                            ]
                        },
                        {
                            name : '勇冠三军',
                            post:require('../../assets/season/Screenshot_20220511_180257_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 60
                                },
                                {
                                    id : 1100,
                                },
                                {
                                    id : 4700,
                                },
                                {
                                    id : 5300,
                                },
                                {
                                    id : 8900,
                                },
                                {
                                    id : 9100,
                                },
                                {
                                    id : 9900,
                                },
                            ]
                        },
                        {
                            name : '无冕之后',
                            post:require('../../assets/season/Screenshot_20220511_180253_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 6400
                                },
                                {
                                    id : 7700
                                },
                                {
                                    id : 8300
                                },
                                {
                                    id : 9400
                                },
                                {
                                    id : 9500
                                },
                                {
                                    id : 9700
                                },
                                {
                                    id : 10120
                                },
                                {
                                    id : 10500
                                },
                                
                                // {
                                //     id : 100
                                // },
                            ]
                        },
                        {
                            name : '定计隆中',
                            post:require('../../assets/season/Screenshot_20220511_180249_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 300,
                                },
                                {
                                    id : 700,
                                },
                                {
                                    id : 2100,
                                },
                                {
                                    id : 3100,
                                },
                                {
                                    id : 4855,
                                },
                                {
                                    id : 5400,
                                },
                                {
                                    id : 6100,
                                },
                                {
                                    id : 8400,
                                },
                                
                            ]
                        },
                    ]
                },
                {
                    name : '备战区',
                    open : false,
                    card_bags : [
                        {
                            name : '名将',
                            post:require('../../assets/season/mmexport1655019600736.png'),
                            pool:[
                                {
                                    id : 100
                            },
                            {
                                    id : 200
                            },
                            {
                                    id : 300
                            },
                            {
                                    id : 400
                            },
                            {
                                    id : 500
                            },
                            {
                                    id : 600
                            },
                            {
                                    id : 700
                            },
                            {
                                    id : 800
                            },
                            {
                                    id : 900
                            },
                            {
                                    id : 1000
                            },
                            {
                                    id : 1100
                            },
                            {
                                    id : 1200
                            },
                            {
                                    id : 1300
                            },
                            {
                                    id : 1400
                            },
                            {
                                    id : 1500
                            },
                            {
                                    id : 1600
                            },
                            {
                                    id : 1700
                            },
                            {
                                    id : 1800
                            },
                            {
                                    id : 1900
                            },
                            {
                                    id : 2000
                            },
                            {
                                    id : 2100
                            },
                            {
                                    id : 2200
                            },
                            {
                                    id : 2300
                            },
                            {
                                    id : 2400
                            },
                            {
                                    id : 2500
                            },
                            {
                                    id : 2600
                            },
                            {
                                    id : 2700
                            },
                            {
                                    id : 2800
                            },
                            {
                                    id : 2900
                            },
                            {
                                    id : 3000
                            },
                            {
                                    id : 3100
                            },
                            {
                                    id : 3200
                            },
                            {
                                    id : 3300
                            },
                            {
                                    id : 3400
                            },
                            {
                                    id : 3500
                            },
                            {
                                    id : 3600
                            },
                            {
                                    id : 3700
                            },
                            {
                                    id : 3800
                            },
                            {
                                    id : 3900
                            },
                            {
                                    id : 4000
                            },
                            {
                                    id : 4100
                            },
                            {
                                    id : 4200
                            },
                            {
                                    id : 4300
                            },
                            {
                                    id : 4400
                            },
                            {
                                    id : 4500
                            },
                            {
                                    id : 4600
                            },
                            {
                                    id : 4700
                            },
                            {
                                    id : 4800
                            },
                            {
                                    id : 4900
                            },
                            {
                                    id : 5000
                            },
                            {
                                    id : 5100
                            },
                            {
                                    id : 5200
                            },
                            {
                                    id : 5300
                            },
                            {
                                    id : 5400
                            },
                            {
                                    id : 5500
                            },
                            {
                                    id : 5600
                            },
                            {
                                    id : 5700
                            },
                            {
                                    id : 5800
                            },
                            {
                                    id : 5900
                            },
                            {
                                    id : 6000
                            },
                            {
                                    id : 6100
                            },
                            {
                                    id : 6200
                            },
                            {
                                    id : 6300
                            },
                            {
                                    id : 6400
                            },
                            {
                                    id : 6500
                            },
                            {
                                    id : 6600
                            },
                            {
                                    id : 6700
                            },
                            {
                                    id : 6800
                            },
                            {
                                    id : 6900
                            },
                            {
                                    id : 7000
                            },
                            {
                                    id : 7100
                            },
                            {
                                    id : 7200
                            },
                            {
                                    id : 7300
                            },
                            {
                                    id : 7400
                            },
                            {
                                    id : 7500
                            },
                            {
                                    id : 7600
                            },
                            {
                                    id : 7700
                            },
                            {
                                    id : 7800
                            },
                            {
                                    id : 7900
                            },
                            {
                                    id : 8000
                            },
                            {
                                    id : 8100
                            },
                            {
                                    id : 8200
                            },
                            {
                                    id : 8300
                            },
                            {
                                    id : 8400
                            },
                            {
                                    id : 8500
                            },
                            {
                                    id : 8600
                            },
                            {
                                    id : 8700
                            },
                            {
                                    id : 8800
                            },
                            {
                                    id : 8900
                            },
                            {
                                    id : 9000
                            },
                            {
                                    id : 9100
                            },
                            {
                                    id : 9200
                            },
                            {
                                    id : 9300
                            },
                            {
                                    id : 9400
                            },
                            {
                                    id : 9500
                            },
                            {
                                    id : 9600
                            },
                            {
                                    id : 9700
                            },
                            {
                                    id : 9800
                            },
                            {
                                    id : 9900
                            },
                            {
                                    id : 10000
                            },
                            {
                                    id : 10100
                            },
                            {
                                    id : 10200
                            },
                            {
                                    id : 10300
                            },
                            {
                                    id : 10400
                            },
                            {
                                    id : 10500
                            },
                            {
                                    id : 10600
                            },
                            ]
                        },
                    ]
                },
                {
                    name : '群雄逐鹿-xp',
                    open : false,
                    card_bags : [
                        {
                            name : '火起洛阳',
                            post:require('../../assets/season/huoqiluoyang433.jpg'),
                            pool:[
                                {
                                    id : 1800
                                },
                                {
                                    id : 2000
                                },
                                {
                                    id : 2500
                                },
                                {
                                    id : 2600
                                },
                                {
                                    id : 2700
                                },
                                {
                                    id : 7400
                                },
                                {
                                    id : 7600
                                },
                                {
                                    id : 8700
                                },
                                // {
                                //     id : 100
                                // },
                            ]
                        },
                        {
                            name : '太师败亡',
                            post:require('../../assets/season/hviaiwhdwi21.jpg'),
                            pool:[
                                {
                                    id : 200
                                },
                                {
                                    id : 400
                                },
                                {
                                    id : 1700
                                },
                                {
                                    id : 2200
                                },
                                {
                                    id : 5500
                                },
                                {
                                    id : 7300
                                },
                                {
                                    id : 8100
                                },
                                {
                                    id : 10300
                                },
                            ]
                        },
                        {
                            name : '魏武之将',
                            post:require('../../assets/season/Screenshot_20220413_175755_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 500
                                },
                                {
                                    id : 3600
                                },
                                {
                                    id : 4300
                                },
                                {
                                    id : 4500
                                },
                                {
                                    id : 8900
                                },
                                {
                                    id : 9100
                                },
                                {
                                    id : 10500
                                },
                                
                            ]
                        },
                        {
                            name : '蜀川人杰',
                            post:require('../../assets/season/Screenshot_20220413_180955_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 100
                                },
                                {
                                    id : 800
                                },
                                {
                                    id : 4900
                                },
                                {
                                    id : 5000
                                },
                                {
                                    id : 5400
                                },
                                {
                                    id : 5800
                                },
                                {
                                    id : 5900
                                },
                                {
                                    id : 9400
                                },
                                
                            ]
                        },
                        {
                            name : '江东虎臣',
                            post:require('../../assets/season/Screenshot_20220413_181039_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 1100
                                },
                                {
                                    id : 1200
                                },
                                {
                                    id : 6000
                                },
                                {
                                    id : 6200
                                },
                                {
                                    id : 6700
                                },
                                {
                                    id : 6900
                                },
                                {
                                    id : 7200
                                },
                                {
                                    id : 10100
                                },
                            ]
                        },
                        {
                            name : '逐鹿中原',
                            post:require('../../assets/season/Screenshot_20220413_180737_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 1600
                                },
                                {
                                    id : 2400
                                },
                                {
                                    id : 2900
                                },
                                {
                                    id : 3200
                                },
                                {
                                    id : 3500
                                },
                                {
                                    id : 3700
                                },
                                {
                                    id : 4100
                                },
                                {
                                    id : 7700
                                },
                            ]
                        },
                        {
                            name : '贼寇为祸',
                            post:require('../../assets/season/Screenshot_20220413_180806_com.netease.stzb.netea.jpg'),
                            pool:[
                                {
                                    id : 700
                                },
                                {
                                    id : 1900
                                },
                                {
                                    id : 3000
                                },
                                {
                                    id : 3100
                                },
                                {
                                    id : 5700
                                },
                                {
                                    id : 6100
                                },
                                {
                                    id : 8400
                                },
                                
                            ]
                        },
                        {
                            name : '逆取顺守',
                            post:require('../../assets/season/wdadash232.jpg'),
                            pool:[
                                {
                                    id : 2800
                                },
                                {
                                    id : 4000
                                },
                                {
                                    id : 4400
                                },
                                {
                                    id : 5300
                                },
                                {
                                    id : 6300
                                },
                                {
                                    id : 7500
                                },
                                {
                                    id : 9700
                                },
                                
                            ]
                        },
                        {
                            name : '三国鼎立',
                            post:require('../../assets/season/sangguodingli3.jpg'),
                            pool:[
                                {
                                    id : 5600
                                },
                                {
                                    id : 7000
                                },
                                {
                                    id : 8200
                                },
                                {
                                    id : 8600
                                },
                                {
                                    id : 9300
                                },
                                {
                                    id : 9600
                                },
                                {
                                    id : 9900
                                },
                                
                            ]
                        },
                        
                    ]
                },
                {
                    name : '决胜中原-xp',
                    open : false,
                    card_bags : [

                    ]
                },
                {
                    name : '群雄讨董-xp',
                    open : false,
                    card_bags : [

                    ]
                },
                
            ]
        }
    }
}
export default seasons